menu_text = {
    'RU': 'Пожалуйста, выберите опцию: '
}

login_menu = {
    'RU': 'Авторизация'
}

news_menu = {
    'RU': 'Новость без приложений'
}

answer_menu = {
    'RU': 'Согласование'
}

attach_menu = {
    'RU': 'Новость с приложением'
}

back2menu = {
    'RU': 'Вы можете вернуться в меню, нажав /menu'
}

login_req = {
    'RU': 'Введите свой логин в системе BIOCAD в формате login'
}

login_check_init_suc = {
    'RU': 'Для начала работы нажмите /menu'
}

login_check_repeat = {
    'RU': 'Вы авторизованы!'
}

user_init_auth = {
    'RU': 'Вы не авторизовались!'
}

user_not_found = {
    'RU': 'Вас нет в базе сотрудников!'
}

login_check_suc = {
    'RU': 'Ваш логин найден! Для продолжения работы нажмите /menu'
}

login_check_fail = {
    'RU': 'Такого логина не существует в базе. Введите логин ещё раз'
}

attach_req = {
    'RU': 'Прикрепите файлы - и НЕ ПИШИТЕ текст новости в caption, если он длиннее 200 символов (текст обрежет)'
}

attach_acq = {
    'RU': 'Файлы получены'
}

news_req = {
    'RU': 'Введите текст новости - и не забудьте добавить нужные хэштеги!'
}

news_acq = {
    'RU': 'Текст новости получен'
}

answer_info = {
    'RU': 'Ответ исполнителю'
}

reminder_text = {
    'RU': 'Вы не публиковали новость больше недели!'
}

answer_neg = {
    'RU': 'Нет новостей для согласования. Нажмите /cancel'
}

answer_rights = {
    'RU': 'У вас недостаточно прав для согласования новостей. Нажмите /cancel'
}

answer_sent_mods = {
    'RU': 'Новость согласована и отправлена на модерацию'
}

answer_sent_user = {
    'RU': 'Новость не согласована, комментарий отправлен пользователю'
}

answer_acq_user = {
    'RU': 'Новость не согласована. Ознакомьтесь с комментарием от руководителя (ниже) '
          'и отправьте новость заново через /menu'
}

cancel_text = {
    'RU': 'Начните диалог заново, нажав /start'
}

boss_not_found = {
    'RU': 'Вы не можете отправить новость, поскольку ваш руководитель ещё не зарегистрирован. Нажмите /cancel'
}

new_news = {
    'RU': 'Вам пришла новость на согласование! Пройдите в /menu и выберите пункт Согласование'
}

sent_repeat = {
    'RU': 'В связи с отключением бота, информация ниже не была отправлена. Пожалуйста, отправьте её повторно'
}

repeater_update = {
    'RU': 'В связи с обновлением функционала, бот был перезапущен.\n'
          'Для начала работы нажмите /start'
}

state_auth = {
    'RU': 'Вы остановились на авторизации.\n'
          'Нажмите /cancel, если хотите начать с начала'
}

state_news = {
    'RU': 'Вы остановились на отправке фото.\n'
          'Нажмите /cancel, если хотите начать с начала'
}

state_no_attach = {
    'RU': 'Вы остановились на написании новости.\n'
          'Нажмите /cancel, если хотите начать с начала'
}

state_answer = {
    'RU': 'Вы остановились на согласовании новости.\n'
          'Нажмите /cancel, если хотите начать с начала'
}

news_sent = {
    'RU': 'Новость успешно отправлена руководителю!'
}

press_ok = {
    'RU': 'Выберите ОК, если новость согласована'
}

news_null = {
    'RU': 'Новость не содержит текста и приложений. Нажмите /cancel'
}

press_mod = {
    'RU': 'Нажмите Модератор, если хотите изменить новость самостоятельно и сразу отправить её модератору\n'
          'Нажмите Сотрудник, если хотите отправить комментарий сотруднику'
}

write_mod = {
    'RU': 'Введите изменённый текст новости для отправки модератору'
}

write_us = {
    'RU': 'Введите изменённый текст новости для отправки сотруднику'
}
