welcome_text = {
    'RU':
        u'Приветствую Вас!\n\n'
        u'Сотрудникам бот поможет публиковать новости, а руководителям - согласовывать их\n'
        u'Бот находится в тестовом режиме\n'
        u'В случае отсутствия ответа от бота - нажмите /cancel'
}

menu_text = {
    'RU': 'Пожалуйста, выберите опцию: '
}

login_menu = {
    'RU': 'Авторизация'
}

news_menu = {
    'RU': 'Новость без приложений'
}

answer_menu = {
    'RU': 'Согласование'
}

attach_menu = {
    'RU': 'Новость с приложением'
}

back2menu = {
    'RU': 'Вы можете вернуться в меню, нажав /menu'
}

login_req = {
    'RU': 'Введите свой логин в системе BIOCAD в формате логин'
}

login_check_init_suc = {
    'RU': 'Для начала работы нажмите /menu'
}

login_check_suc = {
    'RU': 'Вы в базе! Для продолжения работы нажмите /menu'
}

login_check_fail = {
    'RU': 'Такого логина не существует в базе. Введите логин ещё раз'
}

attach_req = {
    'RU': 'Прикрепите файлы'
}

attach_acq = {
    'RU': 'Файлы получены'
}

news_req = {
    'RU': 'Введите текст новости'
}

news_acq = {
    'RU': 'Текст новости получен'
}

answer_info = {
    'RU': 'Ответ исполнителю'
}

reminder_text = {
    'RU': 'Вы не публиковали новость больше суток!'
}

answer_neg = {
    'RU': 'Нет новостей для согласования. Вернитесь в /menu'
}

answer_pos = {
    'RU': 'Поставьте ОК если согласовано, напишите комментарий в противном случае'
}

answer_rights = {
    'RU': 'У вас недостаточно прав для согласования новостей. Нажмите /cancel'
}

answer_sent_mods = {
    'RU': 'Новость согласована и отправлена на модерацию'
}

answer_sent_user = {
    'RU': 'Новость не согласована, комментарий отправлен пользователю'
}

answer_acq_user = {
    'RU': 'Новость не согласована. Ознакомьтесь с комментарием от руководителя (ниже) '
          'и отправьте новость заново через /menu'
}

cancel_text = {
    'RU': 'Начните диалог заново, нажав /start'
}

user_not_found = {
    'RU': 'Вас нет в базе сотрудников! Нажмите /cancel и пройдите авторизацию!'
}

new_news = {
    'RU': 'Вам пришла новость на согласование! Пройдите в /menu и выберите пункт Согласование'
}
