welcome_text = {
    'RU':
        u'Приветствую Вас!\n\n'
        u'Этот бот предназначен для удобной публикации новостей и их согласования с руководителем\n'
        u'/start - начало работы с пользователем\n'
        u'/menu - стартовое меню\n'
        u'/cancel - перезапуск диалога\n'
        u'/help - книга жалоб, предложений и криков о помощи'
}

menu_text = {
    'RU': 'Пожалуйста, выберите опцию: '
}

login_menu = {
    'RU': 'Авторизация'
}

news_menu = {
    'RU': 'Новость без приложений'
}

answer_menu = {
    'RU': 'Согласование'
}

attach_menu = {
    'RU': 'Новость с приложением'
}

back2menu = {
    'RU': 'Вы можете вернуться в меню, нажав /menu'
}

login_req = {
    'RU': 'Введите свой логин в системе BIOCAD в формате логин'
}

login_acq = {
    'RU': 'Логин принят'
}

login_check_init_suc = {
    'RU': 'Для начала работы нажмите /menu'
}

login_check_suc = {
    'RU': 'Вы в базе! Для продолжения работы нажмите /menu'
}

login_check_fail = {
    'RU': 'Такого логина не существует в базе. Введите логин ещё раз'
}

attach_req = {
    'RU': 'Прикрепите файлы'
}

attach_acq = {
    'RU': 'Файлы получены'
}

news_req = {
    'RU': 'Введите текст новости'
}

news_acq = {
    'RU': 'Текст новости получен'
}

answer_info = {
    'RU': 'Ответ исполнителю'
}
about_info = {
    'RU': 'Бот рассыльщик'
}

reminder_text = {
    'RU': 'Вы не публиковали новость больше суток!'
}

answer_neg = {
    'RU': 'Нет новостей для согласования. Вернитесь в /menu'
}

answer_pos = {
    'RU': 'Поставьте ОК если согласовано, напишите комментарий в противном случае'
}
